W7D3/GoalsApp/app/controllers/users_controller.rb

    def create
        @user = User.new(user_params)
        if @user.save
---
INSERT INTO "users" ("username", "password_digest", "session_token") VALUES ($1, $2, $3) RETURNING "id"  [["username", "Edmond"], ["password_digest", "$2a$12$tRLyLJihTEi7X.eNevit6e9bAF280PrlJduCVxleKFZkCGa21lnX6"], ["session_token", "9qBTiALT3aK1vvB1iPVJrQ"]]

    def update
        @user = User.find(params[:id])
        if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 439], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1 WHERE "users"."id" = $2  [["username", "test2"], ["id", 439]]